In [19]:
import pandas as pd 

data = pd.DataFrame({"power_level": [12000, 16000, 4000, 1500, 3000, 
                                     2000, 1600, 2000, 300],
                     "uniform color": ["orange", "blue", "black", "orange",
                                       "purple", "green", "orange", "orange","orange"],
                     "species": ["saiyan","saiyan","saiyan","half saiyan",
                                 "namak","human","human","human","human"]}, 
                     index = ["Goku","Vegeta", "Nappa","Gohan",
                                   "Piccolo","Tien","Yamcha", "Krillin","Roshi"])

In [20]:
data

         power_level uniform color      species
Goku           12000        orange       saiyan
Vegeta         16000          blue       saiyan
Nappa           4000         black       saiyan
Gohan           1500        orange  half saiyan
Piccolo         3000        purple        namak
Tien            2000         green        human
Yamcha          1600        orange        human
Krillin         2000        orange        human
Roshi            300        orange        human

In [21]:
data['uniform color'].max()

'purple'

In [22]:
data.power_level.value_counts().nlargest(5)

2000    2
1500    1
1600    1
3000    1
300     1
Name: power_level, dtype: int64

In [23]:
data.power_level.sum()

42400

In [25]:
data.power_level.nunique()

8

In [24]:
data['power_level'].sum()

42400

In [5]:
def my_function(x, h, l):
    if x >  h:
        return("high")
    if x >  l:
        return("med")
    return ("low")

In [6]:
data["power_level"].apply(my_function, args = [10000, 2000])

Goku       high
Vegeta     high
Nappa       med
Gohan       low
Piccolo     med
Tien        low
Yamcha      low
Krillin     low
Roshi       low
Name: power_level, dtype: object

In [7]:
def mode(x):
    return x.mode()

In [8]:
data.apply(mode, axis = 0)

   power_level uniform color species
0         2000        orange   human

In [9]:
def max_str_len(x):
    return max([len(str(v)) for v in x])

In [10]:
data.apply(max_str_len, axis = 1)

Goku        6
Vegeta      6
Nappa       6
Gohan      11
Piccolo     6
Tien        5
Yamcha      6
Krillin     6
Roshi       6
dtype: int64

In [11]:
def make_char_string(x):
    return(f"{x.species} with power level: {x.power_level}")

In [12]:
data.apply(make_char_string, axis = 1 )

Goku           saiyan with power level: 12000
Vegeta         saiyan with power level: 16000
Nappa           saiyan with power level: 4000
Gohan      half saiyan with power level: 1500
Piccolo          namak with power level: 3000
Tien             human with power level: 2000
Yamcha           human with power level: 1600
Krillin          human with power level: 2000
Roshi             human with power level: 300
dtype: object

In [13]:
# read the training dataset from Kaggle's Titanic competition into a DataFrame
train = pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [14]:
# use a string method to split the 'Name' Series at commas (returns a Series of lists)
train.Name.str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [15]:
# define a function that returns an element from a list based on position
def get_element(my_list, position):
    return my_list[position]

In [16]:
# apply the 'get_element' function and pass 'position' as a keyword argument
train.Name.str.split(',').apply(get_element, position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object